benchmarks/results/amber-site-ws-r1/ws/http-with-1000.txt
=== trial 1 ===
Running 10s test @ http://10.142.0.2:41019/index.json
  4 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.49ms    5.45ms  43.91ms   91.57%
    Req/Sec     1.92k   472.42     3.30k    67.75%
  Latency Distribution
     50%    1.89ms
     75%    2.76ms
     90%    7.01ms
     99%   28.69ms
  76248 requests in 10.01s, 77.15MB read
Requests/sec:   7620.57
Transfer/sec:      7.71MB
=== trial 2 ===
Running 10s test @ http://10.142.0.2:41019/index.json
  4 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.17ms    5.35ms  71.81ms   93.08%
    Req/Sec     2.02k   522.77     3.56k    70.25%
  Latency Distribution
     50%    1.83ms
     75%    2.62ms
     90%    5.48ms
     99%   26.77ms
  80603 requests in 10.00s, 81.56MB read
Requests/sec:   8057.74
Transfer/sec:      8.15MB
=== trial 3 ===
Running 10s test @ http://10.142.0.2:41019/index.json
  4 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms    4.66ms  50.47ms   93.44%
    Req/Sec     2.28k   700.60     3.88k    64.50%
  Latency Distribution
     50%    1.64ms
     75%    2.33ms
     90%    4.46ms
     99%   24.34ms
  90685 requests in 10.00s, 91.76MB read
Requests/sec:   9065.16
Transfer/sec:      9.17MB